takkuumi/idf/sdkconfig.defaults
# =============================================================================
# ESP32-S3R2 项目默认 sdkconfig
# 用途：嵌入式网关（以太网 W5500 + BLE Mesh + IO + AI/AO + RS485 + Modbus）
# 硬件：ESP32-S3R2 (Xtensa LX7 双核 240MHz, 512KB SRAM, 2MB Quad PSRAM)
# =============================================================================

# ---- 目标芯片 ----
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# ---- 时钟与 Flash/PSRAM ----
# 主任务只承载启动和 5ms 调度；控制组态解析使用堆/PSRAM，避免大数组压栈。
# 实机高水位验证后从 32KB 收敛到 24KB，保留工业现场所需余量。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=24576
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE=y
CONFIG_ESP_SYSTEM_PMP_IDE_SPLIT_SIZE=y
# CPU 频率锁定 240MHz (ESP32-S3 最高频, 工业实时性)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# 启用动态调频 (节能), 但 main_loop + 关键任务用 pin_current_to_core 锁定核
# 当前为常供电场景, 关闭 DFS 保持性能稳定
CONFIG_PM_ENABLE=n

# ---- ICache / DCache (ESP32-S3 32KB + 32KB) ----
# 提升代码执行和数据访问速度, 减少 Flash/PSRAM 访问延迟
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_32B=y
CONFIG_ESP32S3_DATA_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# ---- 硬件加密加速器 (AES/SHA/RSA/ECC) ----
# ESP32-S3 内置硬件加速器, 启用后 TLS/BLE Mesh/NVS 加密走硬件
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_GCM=y
CONFIG_MBEDTLS_HARDWARE_ECC=y

# Flash (8MB)。本机 GD Flash 实测 ROM 以 QIO/80MHz 加载二级 bootloader 时
# 在 ets_loader.c:78 持续触发 WDT；DIO/40MHz 已完成全量烧录与 OTA 实机验证。
# 启动可靠性优先于无数据依据的标称频率，禁止烧录工具覆盖为 QIO/80MHz。
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=n
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=n
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
CONFIG_APP_PROJECT_VER="2.2.3"
CONFIG_SPI_FLASH_BROWNOUT_RESET=y
CONFIG_SPI_FLASH_USE_4BLOCK_ERASE=y

# PSRAM (2MB Quad SPI) - ESP32-S3R2 内置
# 策略: >4KB 自动走 PSRAM, 保留 16KB 内部 SRAM 给 DMA/中断/栈
# (ProtoStore 3KB 仍走内部 SRAM; NVS 缓冲区/BLE Mesh 配置走 PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE=2097152
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MODE_QUAD=y
# <4KB 走内部 SRAM (栈/小型 struct/Mutex 等), >=4KB 走 PSRAM
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# LwIP socket/PCB/mbox 动态对象优先进入 PSRAM；W5500 DMA 与 pthread 栈仍为 internal。
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# LOOP23: 保留 64KB 内部 SRAM 不被 PSRAM 分配占用.
# 原值 16384 (16KB) 在 BLE+WiFi+ETH 同时运行时, 内部 SRAM 高度碎片化,
# 导致 ESP-IDF SPI master 的 setup_dma_priv_buffer() 在申请 1536B 临时
# DMA 缓冲 (MALLOC_CAP_DMA|MALLOC_CAP_INTERNAL) 时找不到连续的 64 字节对齐
# 块 → 'Failed to allocate priv TX buffer' 错误持续循环.
# 64KB 保留块保证 DMA 申请始终有连续内部 SRAM 可用, BLE HCI buffer (16KB) +
# W5500 SPI priv buffer (4.5KB × queue_size=3) + ETH DMA (12KB) +
# LwIP PBUF (8KB) + 中断栈 (4KB) 全部在保留区内, 互不干扰.
# 当前 linker 可用 DRAM 段为 333.75KB；64KB reserve 只约束通用 malloc，
# 不能从物理 SRAM 总量直接推导启动后的 free heap，运行时以 minimum free heap 为准。
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
# 允许 PSRAM 分配的内存用 malloc 后备 (大缓冲区优先 PSRAM)
CONFIG_SPIRAM_MALLOC_FAIL_INTERNAL=y

# ---- FreeRTOS ----
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TICK_SUPPORT_CORETIMER=y
CONFIG_FREERTOS_ENABLE_TASK_SNAPSHOT=y
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=2
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_FREERTOS_CHECK_PORT_CRITICAL_COMPLIANCE=y
CONFIG_FREERTOS_TASK_FUNCTION_NAME=y
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=16
# ESP32-S3 双核
CONFIG_FREERTOS_UNICORE=n
# SMP 优化: 允许任务无亲和性 (默认 0x3 = 任意核), 与 pin_current_to_core 配合
CONFIG_FREERTOS_NO_AFFINITY_HIGHEST_BOUND=y
# TLS deletion callbacks: 任务退出时清理资源 (Rust thread::JoinHandle 需要)
CONFIG_FREERTOS_TLSP_DELETION_CALLBACKS=y
# Mesh 需要较多任务
CONFIG_FREERTOS_TIMER_TASK_PRIORITY=22
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
# 任务栈溢出检测 (Canary 模式, 额外 1 word/task, 检测栈溢出)
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
# ESP-IDF C/C++ 组件启用 strong stack protector；Rust 任务另由 FreeRTOS canary、
# watchpoint 和运行时 high-water mark 共同覆盖。
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=n
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
# 任务退出时回收资源 (避免泄露 TCB / 栈)
CONFIG_FREERTOS_TASK_PRE_DELETE_CALLBACK=y
# Watchpoint: 在栈末尾设置硬件 watchpoint, 检测栈越界 (调试用, 已在阶段一启用)
# CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# ---- LwIP / TCP/IP 协议栈 ----
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=8192
CONFIG_LWIP_TCPIP_TASK_AFFINITY_NO_AFFINITY=y
# 固定需求: 4 Modbus listeners + Web listener + UDP + 8 Modbus clients
# + 1 Web active connection = 15. 保留 5 个重连/诊断余量；默认 10 会在
# 第 5 个并发客户端附近触发 EMFILE (errno 23) 并复位 TCP 连接。
CONFIG_LWIP_MAX_SOCKETS=20
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LWIP_TCP_MSS=1440
CONFIG_LWIP_TCP_MAXRTX=12
CONFIG_LWIP_SO_LINGER=y
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_SO_REUSE_RXTOALL=y
CONFIG_LWIP_NETIF_HOSTNAME=y
CONFIG_LWIP_DHCPS=y
CONFIG_LWIP_DHCP=y
CONFIG_LWIP_DHCP_RESTORE_LAST_IP=y
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
CONFIG_LWIP_IP4_FRAG=y
CONFIG_LWIP_TCP_KEEPALIVE=y

# ---- 以太网 (W5500 over SPI) ----
# W5500 驱动内置 ESP-IDF esp_eth 组件, 需启用 CONFIG_ETH_SPI_ETHERNET_W5500
# 通过 esp_eth_mac_new_w5500 / esp_eth_phy_new_w5500 接入
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y
# LOOP23: ETH DMA buffer 数量降到 sdkconfig 最小值 (3 = sdkconfig Kconfig 下限).
# LOOP20/21 已减到 4TX+8RX, 仍偶尔失败 → LOOP23 进一步减到下限, 节省 ~12KB.
# LOOP23 配合 SPIRAM_MALLOC_RESERVE_INTERNAL=64KB 保留区:
#   - W5500 SPI priv buffer (1.5KB × 3 queue) = ~4.5KB 在保留区
#   - ETH TX DMA buffer (1536B × 3) = ~4.6KB 在保留区
#   - ETH RX DMA buffer (1536B × 3) = ~4.6KB 在保留区
#   - BLE HCI buffer ~16KB 在保留区
#   - LwIP PBUF pool ~6KB 在保留区
#   总共 ~36KB, 64KB 保留区完全容纳, 不再与一般堆冲突.
CONFIG_ETH_DMA_BUFFER_SIZE=1536
CONFIG_ETH_DMA_TX_BUFFER_NUM=3
CONFIG_ETH_DMA_RX_BUFFER_NUM=3

# ---- Wi-Fi (ESP32-S3 内置, 作为以太网冗余/配置入口) ----
# 与 BLE 共存: ESP32-S3 内置 coexistence, 软件分时调度
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_ENABLE_SAE=y
# Station 模式 (默认), AP 模式由代码动态切换
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# Wi-Fi 缓冲 (与 BLE 共存时适当降低, 避免 SRAM 占用过多)
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=6
CONFIG_ESP_WIFI_TX_BA_WIN=6
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_NVS_ENABLED=y
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
# 2.4GHz 频段 (ESP32-S3 仅支持 2.4GHz)
# 与 BLE 共存 (推荐 ESP32-S3 软件共存配置)
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
# LWIP DHCP (Wi-Fi 用)
CONFIG_LWIP_DHCPS=y

# ---- BLE 与 BLE Mesh (ESP32-S3R2 内置) ----
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=n
# GATT 回调只做有界重组和队列投递，业务处理已迁移到 main_loop。
# 8KB 仍显著高于 ESP-IDF 默认值（BTC 3KB / BTU 4.25KB），同时释放 8KB internal SRAM。
CONFIG_BT_BTC_TASK_STACK_SIZE=8192
CONFIG_BT_BTU_TASK_STACK_SIZE=8192
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_GATTC_ENABLE=y
CONFIG_BT_GATTC_CONNECT_RETRY_COUNT=3
# BLE Mesh (ESP-IDF v5.5+ 配置项已重命名: BT_BLE_MESH_* -> BLE_MESH_*)
# Generic Server 模型 (代码注册了 OnOff Server, 必须启用)
# Generic OnOff/Level Client 模型
# 使用独立 NVS 分区 (partitions.csv 中的 "ble_mesh" 分区)
# BLE Mesh 栈会自动调用 nvs_flash_init_partition("ble_mesh") 初始化
# 与系统 nvs 分区隔离, 避免 mesh 网络密钥耗尽系统 NVS 空间

# ---- LWIP Socket ----
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_SO_SNDBUF=y
CONFIG_LWIP_TCP_LISTEN_BACKLOG=y
CONFIG_LWIP_TCP_MSL=6000

# ---- Partition Table ----
CONFIG_PARTITION_TABLE_CUSTOM=y
# embuild 的 PROJECT_DIR cmake 属性指向 out 目录, 必须用绝对路径
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="/Users/takumi/Workspace/idf/partitions.csv"

# ---- 日志 ----
# 生产环境: 编译时支持到 DEBUG (减少 VERBOSE 代码体积), 运行时默认 INFO
# 运行时可通过 Modbus 寄存器 0x0106 动态调节 (Err/Warn/Info/Debug/Trace)
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# ---- NVS ----
# NVS 加密 (生产环境启用, 开发期禁用以避免 eFuse/Flash-Enc 依赖)
# 生产部署时需启用: CONFIG_SECURE_FLASH_ENC_ENABLED=y + CONFIG_NVS_ENCRYPTION=y
#   + CONFIG_NVS_SEC_KEY_PROTECT_USING_FLASH_ENC=y (用 nvs_keys 分区)
# nvs_keys 分区已在 partitions.csv 预留, 开发期不使用但无害
CONFIG_NVS_ASSERT_ERROR_CHECK=y

# ---- Core Dump (崩溃转储到 Flash, 工业可靠性) ----
# Panic 时将任务上下文写入 coredump 分区, 重启后可通过 esp_core_dump_get_summary 分析
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=16

# ---- Heap 安全 (工业运行) ----
# Light 模式保留头尾 canary 越界检测；Comprehensive 会在每次分配/释放时填充并
# 扫描大块内存，显著增加实时抖动和内部堆压力，只适合专项实验室诊断。
CONFIG_HEAP_POISONING_LIGHT=y
CONFIG_HEAP_POISONING_COMPREHENSIVE=n

# ---- 安全 ----
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300

# ---- Panic 处理与 Backtrace ----
# Panic 时打印寄存器 + backtrace + 立即重启 (CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT)
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# GDB stub (开发调试用, 默认关)
CONFIG_ESP_SYSTEM_PANIC_GDBSTUB=n
# 启用 backtrace 打印 (启用 decoder)
CONFIG_ESP_SYSTEM_USE_EH_FRAME=y

# ---- OTA 升级 ----
# 允许 OTA 写入 app partition
CONFIG_APP_ROLLBACK_ENABLE=y
# 启动时自动选择有效 OTA 分区
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ---- 串口 ----
# ESP32-S3 UART0 默认 TX=43, RX=44 (与下载/日志共用)
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# ---- VFS ----
CONFIG_VFS_SUPPORT_DIR=y
CONFIG_VFS_SUPPORT_IO=y
CONFIG_VFS_SUPPORT_SELECT=y

# ---- Modbus (esp-idf freemodbus 组件, 如需启用可改 y) ----
# 这里我们使用 Rust 侧的 umodbus crate 实现，故 esp-idf freemodbus 不启用
CONFIG_FMB_MASTER_TIMEOUT_MS_RESPOND=200
CONFIG_FMB_SERIAL_BUFFER_SIZE=256

# ---- System Event Task 栈大小 (IP_EVENT_ETH_GOT_IP / ETHERNET_EVENT 回调栈) ----
# 默认 2304 (2KB). ip_event_cb/eth_event_cb 在事件任务上运行, 调用 log::info! 会
# 在栈上构造 core::fmt::Arguments (~200B) + 临时字符串 buffer. 历史曾发生
# Stack canary watchpoint 触发 (2KB 不足以容纳 log 缓冲 + 多 IP 地址数组).
# 增大到 4096 (4KB): 既容纳所有回调栈深度 (实测峰值 ~600B), 也为 ESP-IDF 内核
# 的事件入队/分发留余量, 从根源杜绝栈溢出崩溃.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=32

# ---- pthread 默认任务栈 ----
# 所有生产任务必须引用 safety::stack_budget 的显式值；此项仅作为遗漏时的保护值。
# pthread 栈固定从 internal SRAM 分配，禁止再用 12KB 默认值放大偶发临时线程。
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# 减小 BLE host 栈 (默认 4096 → 3072) 释放 SRAM
# 注意: ESP-IDF v5.5 Bluedroid 不存在 CONFIG_BT_BLE_HOST_TASK_STACK_SIZE 选项.
# 实际可配置项为 BT_BTC_TASK_STACK_SIZE (默认 3072) + BT_BTU_TASK_STACK_SIZE (默认 4352),
# 两者已在上面显式设为 8192，最终下限由硬件高水位和 72h 压测校准。

# I2C: 旧驱动弃用警告抑制 (LOOP6)
# 我们只用 sw_i2c (软件 I2C, src/hal/sw_i2c.rs) 和新 I2C master 框架
# i2c_bus.rs (MCP23017/F3/F4) 走 esp_idf_hal::i2c 旧 API, 但本项目只用 PCA9555 (sw_i2c)
# 旧驱动被链接但不被调用, 启动时 abort_check 触发弃用警告
CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK=y

# SPI Master ISR in IRAM: LOOP14 确保 SPI DMA 中断处理函数在 IRAM 中运行,
# 避免 cache miss 导致 SPI DMA 完成中断延迟 (BLE+ETH 共存场景).
# 与 ethernet/w5500.rs max_transfer_sz=16384 配合, 减少 W5500 SPI burst descriptor 数.
CONFIG_SPI_MASTER_ISR_IN_IRAM=y
